# git - это система управления версиями кода
# github - сайт корорый дает хранилище для кода
# так же есть gitlab, bitbucket

# репозиторий - папка с проектом с которой может работать git

# ssh-keygen - созданиие ключа

# git config --global user.name 'your name'
# git config --global user.email 'your email'
#  указание своих данных


# git init - превратить папку в репозиторий и создает скрытую паку git 

#  создаете репозиторий на github
# git remote add origin < ссылка на репозиторий> -добавить ссылку на репозиторий в переменную origin

#  git add . / filename - добавляет указанные файлы в индекс / насинает отслеживание файлов

# git commit -m "названия для версии" - созданиие версии кода /создать сохранение кода

# git push origin имя_ветки - отправить версию кода на github